<?php 

/*
* [ Duankou Inc ]
* 本方法供用户资料配对
* Created on 2011-8-5
* @author tianyongchun@yeah.net
* 
*/
/**
 * 
 *$name 类型 如 info,life
 *$value 名字如 name,sex	
 *$ismulti 	值如 1
 *$ismulti 0,1 是否为多个，多个则需要将value传值为1,3,4返加为 体育，看书
 */
function dkpair($type='',$name='',$value='',$ismulti='')
{
	$data = get_dkpair_array();
	$result = '';
	if($ismulti){
		//返回多个的组合
		$arr = explode(',',$value);
		foreach($arr as $r){
			if(!empty($r)){
				if(isset($data[$type][$name][$r]))
    				$result = $data[$type][$name][$r].'、';
			}
		}
		if(substr($result,-1,1)=='、')
			$result = substr($result,0,-1);
	}else{
		if(isset($data[$type][$name][$value]))
    	$result = $data[$type][$name][$value];
	}
	
    	echo $result;
}

/**
 * 
 *$name 类型 如 info,life
 *$value 名字如 name,sex	
 *$ismulti 	值如 1
 *$ismulti 0,1 是否为多个，多个则需要将value传值为1,3,4返加为 体育，看书
 * 上面的方法最后没有返回值由于不知道别人用过没有，所以复制了一个改成了return
 */
function returnInfomation($type,$name,$value,$ismulti='')
{
	
        $data = get_dkpair_array();
    if($ismulti){
		//返回多个的组合
        $result=array();
		$arr = explode(',',$value);
        $count=count($arr);
		for($i=0;$i<$count;$i++){
                    if($arr[$i] && isset($data[$type][$name][$arr[$i]])){
                        $result[] = $data[$type][$name][$arr[$i]];
                    }
		}
    	return join('、',$result);
    }elseif(isset($data[$type][$name][$value])){
        return $data[$type][$name][$value];
    }
}

function get_dkpair_array(){
$data =array (
  'life' => 
  array (
    'lifeskill' => 
    array (
      1 => '实现个人目标',
      2 => '维护朋友圈关系',
      3 => '装修房屋',
      4 => '志愿者/义工',
      5 => '热衷电脑',
      6 => '保持生活调理',
      7 => '理财',
      8 => '在家款待朋友',
      9 => '抚养或照顾孩子',
      10 => '制造浪漫',
      11 => '社交活动',
      12 => '谈生意',
      13 => '保持健康',
      14 => '解决冲突',
      15 => '博闻强识',
      16 => '对自我长期规划',
      17 => '在简单中寻求快乐与满足',
      19 => '结交新朋友',
      20 => '烹饪',
      21 => '赚钱养家',
      22 => '保养、修理汽车',
      23 => '做别人的好朋友好同事',
      24 => '其他',
    ),
  ),
  'interest' => 
  array (
    'sports' => 
    array (
      25 => '足球',
      26 => '篮球',
      27 => '排球',
      28 => '网球',
      29 => '羽毛球',
      30 => '乒乓球',
      31 => '壁球',
      32 => '保龄球',
      33 => '手球',
      34 => '橄榄球',
      35 => '棒球',
      36 => '高尔夫',
      37 => '健身',
      38 => '跑步',
      39 => '自行车',
      40 => '摩托车',
      41 => '汽车',
      42 => '舞蹈',
      43 => '体操',
      44 => '跆拳道',
      45 => '柔道',
      46 => '空手道',
      47 => '游泳',
      48 => '潜水',
      155 => '水上运动',
      156 => '航海',
      157 => '滑雪/滑冰',
      158 => '拳击',
      159 => '钓鱼',
      160 => '瑜伽',
      161 => '武术',
      162 => '其他',
    ),
    'foods' => 
    array (
      49 => '中国菜',
      50 => '印度菜',
      51 => '泰国菜',
      52 => '法国菜',
      53 => '意大利菜',
      54 => '俄罗斯菜',
      55 => '日本菜',
      56 => '烧烤',
      57 => '健康食品',
      58 => '素食',
      59 => '快餐',
      60 => '甜点',
      61 => '其他',
      62 => '无特别爱好',
    ),
    'books' => 
    array (
      63 => '校园青春',
      64 => '文学',
      65 => '艺术与摄影',
      66 => '励志与成功',
      67 => '动漫与幽默',
      68 => '政治与军事',
      163 => '哲学与宗教',
      164 => '历史传记',
      168 => '旅游',
      169 => '投资理财',
      170 => '婚恋与家庭',
      171 => '烹饪与饮食',
      172 => '运动健身',
      173 => '健康与养生',
      174 => '期刊杂志',
      175 => '娱乐时尚',
      176 => '人文社科',
      177 => '自然科学',
      178 => '收藏与鉴赏',
      179 => '其他',
      180 => '什么都不看',
    ),
    'movies' => 
    array (
      77 => '偶像剧',
      78 => '喜剧',
      79 => '动作冒险',
      80 => '古装武侠',
      81 => '科幻魔幻',
      82 => '嫌疑推理',
      83 => '恐怖片',
      84 => '历史传记',
      85 => '战争',
      86 => '音乐歌舞',
      87 => '纪录片',
      88 => '剧情',
      89 => '西方影剧',
      90 => '其他',
      91 => '什么都看',
    ),
    'programs' => 
    array (
      92 => '政治事件',
      93 => '娱乐八卦',
      94 => '体育赛事',
      95 => '理财投资',
      96 => '相声曲艺',
      97 => '海拔活动',
      98 => '畅销书',
      99 => '影视热片',
      100 => '休闲生活',
      101 => '行业发展',
      102 => '居家',
      103 => '其他',
    ),
    'entertainment' => 
    array (
      104 => '饭店',
      105 => '商场',
      106 => '剧院',
      107 => '酒吧',
      108 => '电影院',
      109 => '音乐会',
      110 => '迪斯科',
      111 => '网吧',
      112 => '温泉',
      113 => '图书馆/书店',
      114 => '咖啡厅',
      115 => '游乐场',
      116 => '卡拉OK',
      117 => '体育馆',
      118 => '逛街',
      119 => '宅在家里',
      120 => '其他',
      121 => '不想说',
    ),
    'hobby' => 
    array (
      122 => '网络',
      123 => '汽车',
      124 => '动物',
      125 => '摄影',
      126 => '影视',
      127 => '音乐',
      128 => '写作',
      129 => '购物',
      130 => '手工艺',
      131 => '园艺',
      132 => '舞蹈',
      133 => '展览',
      134 => '烹饪',
      135 => '读书',
      136 => '绘画',
      137 => '计算机',
      138 => '体育运动',
      139 => '旅游',
      140 => '电子游戏',
      141 => '其他',
    ),
    'travel' => 
    array (
      142 => '惬意海岛',
      143 => '名山古刹',
      144 => '繁华都市',
      145 => '风情名城',
      146 => '广袤森林',
      147 => '高原雪域',
      148 => '秀美山水',
      149 => '历史遗迹',
      150 => '江河大川',
      151 => '峻秀峡谷',
      152 => '小桥流水人家',
      153 => '古道西风瘦马',
      154 => '还没想好',
    ),
  ),
);

	 //公司行业
	 $data['info']['company_trade'] =array('1'=>'IT信息技术','2'=>'金融','4'=>'互联网','5'=>'广告传媒','6'=>'贸易零售','7'=>'交通物流','8'=>'房地产','9'=>'旅游餐饮',
'10'=>'加工制造业','11'=>'石化采掘','12'=>'农林牧渔','13'=>'社会服务','14'=>'医药生物','15'=>'教育培训科研');
	
	 //基本资料
	   $data['info']['sex'] =array('1'=>'男','2'=>'女','3'=>'保密');
	  
	   $data['info']['marry'] =array('1'=>'单身','2'=>'正在恋爱中','3'=>'已订婚','4'=>'已婚','5'=>'关系复杂',
									'6'=>'开放式的交往关系','7'=>'丧偶','8'=>'分居','9'=>'离婚');	
	   $data['info']['haschildren'] =array('1'=>'有','2'=>'无');
									
		
		//生活情况
		
		
		 $data['life']['smoke'] =array('1'=>'不吸，很反感吸烟','2'=>'不吸，但是不反感','3'=>'社交时偶尔吸','4'=>'每周吸几次',
								'5'=>'每天都吸','6'=>'有烟瘾');
	
		 $data['life']['drink'] =array('1'=>'不喝','2'=>'社交需要时喝','3'=>'有兴致时喝','4'=>'每天都要喝');
		 
		 $data['life']['religion'] =array('1'=>'无宗教信仰','2'=>'大乘佛教显宗','3'=>'大乘佛教密宗','4'=>'小成佛教','5'=>'道教','6'=>'儒教',
	'7'=>'基督教天主教派','8'=>'基督教东正教派','9'=>'基督教新教派','10'=>'犹太教','11'=>'伊斯兰教什叶派','12'=>'伊斯兰教逊尼派','13'=>'印度教','14'=>'神道教','15'=>'萨满教','16'=>'其他宗教');
		
		 $data['life']['workrest'] =array('1'=>'正常的作息时间','2'=>'晚睡早起','3'=>'黑白颠倒','4'=>'偶尔熬夜','5'=>'经常熬夜');
		
		 $data['life']['personality'] =array('1'=>'浪漫迷人','2'=>'成熟稳重','3'=>'风趣幽默','4'=>'乐天达观','5'=>'活泼可爱','6'=>'忠厚老实','7'=>'淳朴害羞',
	'8'=>'温柔体贴','9'=>'多愁善感','10'=>'新潮时尚','11'=>'热辣动感','12'=>'豪放不羁');
	
	$data['life']['children_order'] =array('1'=>'独子','2'=>'大哥','3'=>'小弟','4'=>'大姐','5'=>'小妹');
	
		//学校相关信息
		$data['school']['univeristy_level'] =array('9'=>'博士','8'=>'硕士','7'=>'研究生','6'=>'本科','5'=>'大专');
		$data['school']['heighschool_level'] =array('4'=>'高中','3'=>'初中');
		$data['school']['primaryschool'] =array('2'=>'小学','1'=>'学前');
		//在校情况
		$data['user']['at_school_type'] =array('0'=>'(未填写)','1'=>'奖学金','2'=>'获得奖项','3'=>'担任职务','4'=>'社会实践');
		
		//在校情况获得奖项   
		$data['user']['at_school_level'] =array('0'=>'(未填写)','1'=>'班组级','2'=>'院校级','3'=>'县市级','4'=>'省区级','5'=>'国家级','6'=>'国际级');
		//在校情况获得奖学金    获得奖项级别:1:班组级,2:院校级,3:县市级,4:省区级,5:国家级,6:国际级
		$data['user']['at_school_scholarship'] =array('5'=>'院系级','4'=>'学校级','3'=>'省市级','2'=>'国家级','1'=>'国际级');
		$data['user']['at_school_scholarship_rank'] =array('1'=>'特等奖','2'=>'一等奖','3'=>'二等奖','4'=>'三等奖');
		
		// 奖学金内容等级:1:特等奖,2:一等奖,3:二等奖,4:三等奖
        //专业技能类型         
         $data['user']['exper_type'] =array('1'=>'计算机/IT','2'=>'机械维修','3'=>'生产技工','4'=>'园林艺术','5'=>'手工艺','6'=>'烹饪/餐饮','7'=>'服装/服饰','8'=>'驾驶','9'=>'安全保护','10'=>'语言翻译','11'=>'建筑/装修','12'=>'医护/美容','13'=>'其他');                                                           
         //专业技能掌握程度                                                            
         $data['user']['exper_level'] =array('0'=>'(未填写)','1'=>'精通','2'=>'熟练','3'=>'一般','4'=>'了解'); 
         
         //语言情况
         $data['user']['language_type'] =array('1'=>'英语','2'=>'日语','3'=>'法语','4'=>'德语','5'=>'俄语',
				'6'=>'韩语','7'=>'西班牙语','8'=>'葡萄牙语','9'=>'阿拉伯语','10'=>'意大利语','11'=>'其它'); 
				
		//语言 读		                                                         
         $data['user']['language_rw'] =array('0'=>'(未填写)','1'=>'一般','2'=>'良好','3'=>'熟练','4'=>'精通');  
		//语言 写	                                                         
         $data['user']['language_listen'] =array('0'=>'(未填写)','1'=>'一般','2'=>'良好','3'=>'熟练','4'=>'精通');  
            //根据usr_tel_nation获取对应的国家名称
         $data['user']['tel_nation'] = array(
              '86' => '中国',
              '61' => '澳大利亚',
              '33' => '法国',
              '64' => '新西兰',
              '65' => '新加坡',
              '44' => '英国',
              '1' => '美国',
              '1' => '加拿大',
              '349' => '德国',
              '82' => '韩国',
              '81' => '日本',
              '39' => '意大利',
              '353' => '爱尔兰',
              '31' => '荷兰',
              '60' => '马来西亚',
              '41' => '瑞士',
              '66' => '泰国',
              '380' => '乌克兰',
              '27' => '南非',
              '358' => '芬兰',
              '46' => '瑞典',
              '34' => '西班牙',
              '32' => '比利时',
              '47' => '挪威',
              '45' => '丹麦',
              '63' => '菲律宾',
              '48' => '波兰',
              '91' => '印度',
              '43' => '奥地利',
              '7' => '俄罗斯',
                                        );
         
         
                                                                   
	return $data;	
}
/**
 * 把数字转换成对应的家庭成员关系
 * @author hxm
 * @date 2012/06/22
 * 
 */
function changeTypeToFamily($type){
$family = array('1'=>'姐姐',
                '2'=>'太太',
                '3'=>'妈妈',
                '4'=>'女儿',
                '5'=>'妹妹',
                '6'=>'外祖母',
                '7'=>'孙女',
                '8'=>'姨妈（母亲的姐姐）',
                '9'=>'姑妈（父亲的姐姐）',
                '10'=>'姨妈（母亲的妹妹）',
                '11'=>'姑妈（父亲的妹妹）',
                '12'=>'外甥女',
                '13'=>'侄女',
                '14'=>'表姐妹',
                '15'=>'堂姐妹',
                '16'=>'姻亲（女）',
                '17'=>'儿媳妇',
                '18'=>'岳母',
                '19'=>'婆婆',
                '20'=>'女性伙伴',
	            '21'=>'哥哥',
                '22'=>'老爷',
                '23'=>'爸爸',
                '24'=>'儿子',
	            '25'=>'弟弟',
                '26'=>'外祖父',
                '27'=>'孙子',
                '28'=>'姨父（母亲的姐姐的丈夫）',
	            '29'=>'姑父（父亲的姐姐的丈夫）',
                '30'=>'姨父（母亲的妹妹的丈夫）',
                '31'=>'姑父（父亲的妹妹的丈夫）',
                '32'=>'外甥',
	            '33'=>'侄儿',
                '34'=>'表兄弟',
                '35'=>'堂兄弟',
                '36'=>'姻亲（男）',
	            '37'=>'女婿',
                '38'=>'岳父',
                '39'=>'公公',
                '40'=>'男性伙伴',
                );
return $family[$type];
}

/**
 * 获取用户资料信息
 * @param int/string $uid
 * @author fbbin
 * @return array
 */
function getUserInfo( $uids )
{
	$rs = array();
    if(is_array($uids)){
    	foreach($uids as $key=>$val){
    		$item = service('User')->getUserInfo($val);
    		$rs[] = $item;
    	}
    }else{
    	$info = service('User')->getUserInfo($uids);
    	$rs = $info;
    }  
	return $rs;
}

/*
 +------------------------------------
 * author chenxujia
 * data 2012-03-22
 * @param string $key post值
 * @return string
 +------------------------------------
 */

function P($key = '',$filter=true) {
    if (empty($key)) {
        return '';
    }
    $ci = &get_instance();
    $get_post = $ci -> input -> post($key);  
    
    if($filter=== FALSE)
    {
        return $get_post;
    }
    if (get_magic_quotes_gpc()) {
        $get_post = stripcslashes_deep($get_post);
    }
    
    if (is_string($get_post)) {
        return shtmlspecialchars(trim($get_post));
    } else {
        return shtmlspecialchars($get_post);
    }
}

function stripcslashes_deep($var) {
    if (is_array($var) && $var) {
        foreach ($var as $k => $v) {
            $var[$k] = stripcslashes_deep($v);
        }
        return $var;
    } else if (is_string($var)) {
        return stripcslashes($var);
    } else {
        return "";
    }
}


/**
 * 此方法已不加载语言包
 * 兼容原有的code
 * @modify by zengmingming
 */
function L($item) {
    return $item;
}

function filterKeys(array $keys, array $oldVals) {//过滤没有修改的数据	
    if (!$keys && $oldVals) {
        return false;
    }
    $returns = array();
    foreach ($keys as $key => $value) {
        if (isset($_POST[$key]) && ($_POST[$key] !== $oldVals[$value])) {
            $returns[] = $key;
        }
    }
    return $returns;
}


/**
 * 获取post的值
 *
 * @modify bohailiang
 * @date   2012/4/1
 * @param  $keys          array
 * @param  $usefulKeys    array
 * @access public
 * @return true / false
 */
function getKeyVals(array $keys, array $usefulKeys) {
    if (!($keys && $usefulKeys)) {
        return false;
    }    
    $keyVals = array();
    foreach ($usefulKeys as $value) {
        $post_value = P($value,FALSE);          
        if (isset($keys[$value])) {
            $keyVals[$keys[$value]] = $post_value;
            //vlaue可能是数组 不能简单的用P函数处理
        }
    }
    return $keyVals;
}

 ?>